Noname8823/STM32WLE5CCU6_LORAWAN/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32wlxx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define RTC_N_PREDIV_S 10
#define RTC_PREDIV_S ((1<<RTC_N_PREDIV_S)-1)
#define RTC_PREDIV_A ((1<<(15-RTC_N_PREDIV_S))-1)
#define LED1_Pin GPIO_PIN_15
#define LED1_GPIO_Port GPIOB
#define LED2_Pin GPIO_PIN_9
#define LED2_GPIO_Port GPIOB
#define PROB3_Pin GPIO_PIN_14
#define PROB3_GPIO_Port GPIOB
#define RF_CTRL3_Pin GPIO_PIN_3
#define RF_CTRL3_GPIO_Port GPIOC
#define BUT1_Pin GPIO_PIN_0
#define BUT1_GPIO_Port GPIOA
#define BUT1_EXTI_IRQn EXTI0_IRQn
#define PROB2_Pin GPIO_PIN_13
#define PROB2_GPIO_Port GPIOB
#define RF_CTRL2_Pin GPIO_PIN_5
#define RF_CTRL2_GPIO_Port GPIOC
#define PROB1_Pin GPIO_PIN_12
#define PROB1_GPIO_Port GPIOB
#define RF_CTRL1_Pin GPIO_PIN_4
#define RF_CTRL1_GPIO_Port GPIOC
#define BUT3_Pin GPIO_PIN_6
#define BUT3_GPIO_Port GPIOC
#define BUT2_Pin GPIO_PIN_1
#define BUT2_GPIO_Port GPIOA
#define BUT2_EXTI_IRQn EXTI1_IRQn
#define LED3_Pin GPIO_PIN_11
#define LED3_GPIO_Port GPIOB
#define USARTx_RX_Pin GPIO_PIN_3
#define USARTx_RX_GPIO_Port GPIOA
#define USARTx_TX_Pin GPIO_PIN_2
#define USARTx_TX_GPIO_Port GPIOA
#define PROB4_Pin GPIO_PIN_10
#define PROB4_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */
/* USER CODE BEGIN Private defines */

/*
 * Custom board pin mapping
 *
 * IN1 = PB5
 * IN2 = PB6
 * IN3 = PB7
 * IN4 = PB8
 *
 * Quy ước input opto:
 * 0 = có tín hiệu
 * 1 = không có tín hiệu
 */
#define IN1_Pin                 GPIO_PIN_5
#define IN1_GPIO_Port           GPIOB

#define IN2_Pin                 GPIO_PIN_6
#define IN2_GPIO_Port           GPIOB

#define IN3_Pin                 GPIO_PIN_7
#define IN3_GPIO_Port           GPIOB

#define IN4_Pin                 GPIO_PIN_8
#define IN4_GPIO_Port           GPIOB

/*
 * RS485 MAX3485 direction pin
 *
 * USART2_DR = PA4
 * PA4 = 0: Receive mode
 * PA4 = 1: Transmit mode
 */
#define USART2_DR_Pin           GPIO_PIN_4
#define USART2_DR_GPIO_Port     GPIOA

/*
 * USART2 dùng cho RS485
 *
 * PA2 = USART2_TX
 * PA3 = USART2_RX
 *
 * Project mẫu đang dùng alias USARTx_TX/RX rồi,
 * nên giữ nguyên define cũ ở phía trên:
 *
 * #define USARTx_RX_Pin GPIO_PIN_3
 * #define USARTx_RX_GPIO_Port GPIOA
 * #define USARTx_TX_Pin GPIO_PIN_2
 * #define USARTx_TX_GPIO_Port GPIOA
 */

/* USER CODE END Private defines */
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
